In [3]:
import pandas as pd
import numpy as np
print("setup complete")

setup complete

In [4]:
r1 = np.arange(0,18,2)
r1

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16])

In [5]:
ser = pd.Series(r1)
ser

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
dtype: int32

In [6]:
df = pd.DataFrame(r1.reshape(3,3),columns=['A','B','C'])
df

    A   B   C
0   0   2   4
1   6   8  10
2  12  14  16

In [7]:
# puissance
np.power(df,2)

     A    B    C
0    0    4   16
1   36   64  100
2  144  196  256

In [11]:
pib = pd.Series({'US':1234.56,'JAP':3456.78,'CHI':8910.11},name='pib')

In [12]:
pib

US     1234.56
JAP    3456.78
CHI    8910.11
Name: pib, dtype: float64

In [17]:
pibpop = pd.Series({'US':9876,'JAP':6543,'UK':5432},name='pib/hab')

In [18]:
pib*10000000/pibpop

CHI             NaN
JAP    5.283173e+06
UK              NaN
US     1.250061e+06
dtype: float64

In [22]:
r2 = np.arange(0,20,2)
r2

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [23]:
df1 = pd.DataFrame(r2.reshape(5,2),columns=['A','B'])
df1

    A   B
0   0   2
1   4   6
2   8  10
3  12  14
4  16  18

In [24]:
df2 = pd.DataFrame(r2.reshape(2,5),columns=['A','B','C','D','E'])
df2

    A   B   C   D   E
0   0   2   4   6   8
1  10  12  14  16  18

In [25]:
df1 + df2

      A     B   C   D   E
0   0.0   4.0 NaN NaN NaN
1  14.0  18.0 NaN NaN NaN
2   NaN   NaN NaN NaN NaN
3   NaN   NaN NaN NaN NaN
4   NaN   NaN NaN NaN NaN